In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

## マージ

In [2]:
dframe1 = DataFrame({'key':list('XZYZXX'), 'data_set_1':np.arange(6)})

In [3]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [4]:
 dframe2 = DataFrame({'key':list('QYZ'), 'data_set_2':np.arange(3)})

In [5]:
dframe2

  key  data_set_2
0   Q           0
1   Y           1
2   Z           2

In [6]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           2
1   Z           3           2
2   Y           2           1

(INNER JOIN)

In [8]:
pd.merge(dframe1, dframe2, on='key')

  key  data_set_1  data_set_2
0   Z           1           2
1   Z           3           2
2   Y           2           1

(LEFT JOIN)

In [9]:
pd.merge(dframe1, dframe2, on='key', how='left')

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         2.0
2   Y           2         1.0
3   Z           3         2.0
4   X           4         NaN
5   X           5         NaN

(RIGHT JOIN)

In [11]:
pd.merge(dframe1, dframe2, on='key', how='right')

  key  data_set_1  data_set_2
0   Z         1.0           2
1   Z         3.0           2
2   Y         2.0           1
3   Q         NaN           0

(OUTER JOIN)

In [12]:
pd.merge(dframe1, dframe2, on='key', how='outer')

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         2.0
4   Z         3.0         2.0
5   Y         2.0         1.0
6   Q         NaN         0.0

In [13]:
dframe3 = DataFrame({'key':list('XXXYZZ'), 'data_set_3': range(6)})

In [15]:
dframe4 = DataFrame({'key':list('YYXXZ'), 'data_set_4': range(5)})

In [16]:
dframe3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [17]:
dframe4

  key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

多対多
- Xが6行になる(3x2)

In [18]:
pd.merge(dframe3, dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [ ]:
df_left = DataFrame({'key1':['SF','SF','LA'],
                    'key2':['one','two,']})